# IsValidObject Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
MassGBXMLExportOptions..::..IsValidObject Property
MassGBXMLExportOptions Class See Also
---
Specifies whether the .NET object represents a valid Revit entity.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsValidObject { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsValidObject As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsValidObject {
	bool get ();
}
```

# ### Return Value
True if the API object holds a valid Revit native object, false otherwise.
# Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
# See Also
MassGBXMLExportOptions Class
Autodesk.Revit.DB.Analysis Namespace